SCON-534: Add diagrams
